# Чернеги Вікторії   Б19_д/122Б
'''
Сформувати функцію, що буде обчислювати факторіал заданого користувачем
натурального числа n.
'''

import time                                                 # імпортування бібліотеки

def fact_rec(n):                                            # функція для визначення факторіала рекурсивно
    global start                                            # глобальна змінна початку відліку часу
    start = time.time()
    if n == 0:                                              # визначення факторіала
        return 1
    else:
        return n * fact_rec(n-1)


print(f"Factorial: {fact_rec(int(input('n = ')))}")         # виведення рузлятату викликаної функції визначення значення факторіала від введеного користувачем числа
print(f'Time: {time.time() - start} seconds')               # час виконання програми

def fact_iter(n):                                           # функція для визначення факторіала ітерацією
    start = time.time()                                     # відлік часу
    fact = 1                                                # змінна факторіала
    while n > 1:                                            # цикл для визначення факторіала, з умовою n > 1
        fact *= n                                           # множення чисел
        n -= 1                                              # віднімання числа
    print(f'Factorial: {fact}')                             # виведення значення факторіала від числа введеного користувачем
    print(f'Time: {time.time() - start} seconds')           # ча викоанання програми

fact_iter(int(input('n = ')))                               # виклик функції і введення числа

'''
На мою думку, для обчислення факторіала краще використовувати ітерацію, оскільки вона не обмежується стеком і не зберігає в пам'яті 
минулі значення числа, таким чином, функція виконується швидше, ефективніше і з меншим використанням пам'яті.
'''